:PROPERTIES:
:ID:       57ff146b-58af-4521-875a-f756d604d71e
:END:
#+title: ruby-str
#+date: [2024-08-06 二]
#+last_modified:  


#+BEGIN_SRC ruby :noweb yes :results output
a = "my age is #{18 + 2}"
puts a
# puts b
#+END_SRC

#+RESULTS:
: my age is 20



#+BEGIN_SRC ruby :noweb yes :results output
a = "String"

b = a * 2

puts b
#+END_SRC

#+RESULTS:
: StringString


#+BEGIN_SRC ruby :noweb yes :results output
a = "123456"

puts a[0]
puts a[-1]
puts a[0,6]
#+END_SRC

#+RESULTS:
: 1
: 6
: 123456
: 6


#+BEGIN_SRC ruby :noweb yes :results output
a = "aa"
p a.succ
p a

p a.succ!
p a

p "99".succ
p "a9".succ
p "Az".succ
#+END_SRC

#+RESULTS:
: "ab"
: "aa"
: "ab"
: "ab"
: "100"
: "b0"
: "Ba"
